// Задачи на if-else if
// Задача 1: Калькулятор возраста без ввода AgeCalculator
// Задача 2: Определение сезона без ввода SeasonIdentifier
// switch-case
// 1 Задача 1: Калькулятор без ввода Calculator
// Задача 2: Оценка дня без ввода MoodOfDay

// Калькулятор возраста без ввода AgeCalculator

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
