<details style="margin-top: 16px">
  <summary style="cursor: pointer; color: blue;"><b>English</b></summary>

 - тут пока ни чего нет ;)

</details>

<hr>

<details style="margin-top: 16px">
  <summary style="cursor: pointer; color: blue;"><b>На русском</b></summary>

### Задача 1 "Оценки"

Создайте массив из 5 элементов для хранения оценок студента. Заполните массив оценками и вычислите средний балл
студента.

- используйте Scanner для заполнения массива.

### Задача 2 Удаление элемента
Напишите программу, которая удаляет из массива элемент по условиям:
- по заданной позиции.
- по значению

### Задача 3 Частотный анализ
Программа должна подсчитать, сколько раз каждое число встречается в массиве и вывести результат в коноль.

### Задача 4 Число встреч
Пользователь вводит два числа: длину массива и число X. Программа заполняет массив случайными числами (число X может не оказаться в масиве).
**Задача** — найти, сколько раз число X встречается в массиве. 

### Задача 5 Проверка на уникальность
Программа должна проверять, все ли элементы в массиве уникальны.

### Задача 6 "Слова в обратном порядке"

Пользователь вводит нескольких слов. Сохраните каждое слово в массиве и выведите все слова в обратном порядке.

### Задача 7 *

**Цель задачи:**
Найти и вывести имя друга, который съел больше всех кусков пиццы.

У вас есть массив из 6 элементов, каждый из которых представляет количество кусков пиццы, съеденных 6 друзьями.
Выведите имя друга, который съел больше всех.

- Создайте массив, который будет содержать количество кусков пиццы, съеденных каждым из 6 друзей. `{2, 4, 3, 5, 1, 3}`
- Создайте массива с именами друзей: `{"Алекс", "Борис", "Вера", "Галя", "Дима", "Елена"}`
- Найдите максимально значение в первом массиве и запомните индекс этого значения. В нашем примере максимально е
  значение 5, под индексом 3
- Найдите друга во втором массиве, который съел больше всех кусков пиццы. В нашем примере это - Галя

### Задача 8 !*** "Морской бой на минималках"

Создайте одномерный массив из 10 элементов для представления поля в морском бое. Один или два элемента будут "
кораблями". Пользователь пытается их "потопить", вводя индексы.

- корабалик считается установленным, если значение ячейки = `1`
- если пользователь угадал расположение кораблика, то кораблик считается уничтоженным и значение должно быть изменено
  на `-1`
- программа должна сообщить пользователю, если пользователь дважды стреляет в одну ячейку
- программа должна сообщить пользователю, если пользователь стреляет в ячейку где уже был потоплен кораблик
- программа должна считать количество выстрелов и по завершению выводить результат
- игра продолжается пока все кораблики не будет уничтожены!

### Задача 9 Управление складом

У вас есть склад с товарами. Каждый товар имеет свою стоимость и количество на складе. Нужно реализовать
следующие функции:

* Добавление товара на склад: Пользователь вводит название, стоимость и количество.
* Удаление товара со склада: По названию товара.
* Поиск самого дорогого товара: Вывести название и стоимость.
* Общая стоимость товаров на складе: Подсчет и вывод.
* Вывод информации о всех товарах: Название, стоимость, количество.

  **Технические требования:**
* Для хранения информации о товарах использовать массивы.
* Для ввода данных использовать Scanner.

**Важно**: Для сравнения строк `String` (и любых объектов) в java используйте метод `equals()`, пример:

````java
public class Main() {

    public static void main(String[] args) {
        // дано
        String firstStr = "Hello";
        String dublicatOfFirstString = "Hello";
        String secondStr = "World";

        // сравнение с использованием equals
        boolean isStringsEquals = firstStr.equals(secondStr);       // false

        isStringsEquals = dublicatOfFirstString.equals(firstStr);   // true    
        isStringsEquals = firstStr.equals(dublicatOfFirstString);   // true    

        isStringsEquals = "Test".equals("test");                    // false
        isStringsEquals = "Test".equals("Test");                    // true

        isStringsEquals = firstStr.equals("test");                  // false
        isStringsEquals = firstStr.equals("Hello");                 // true

        isStringsEquals = "test".equals(firstStr);                  // false
        isStringsEquals = "Hello".equals(firstStr);                 // true

    }
}
````

  <details style="margin-top: 16px">
    <summary style="cursor: pointer; color: blue;"><b>Подсказки:</b></summary>

- Для решения этой задачи вам понадобятся несколько массивов для хранения информации о товарах: один для названий, один
  для стоимости и один для количества. Возможно, вы захотите использовать циклы и условные операторы для реализации
  различных функций.
- используйте меню, пример:

````
            System.out.println("1: Добавить товар");
            System.out.println("2: Удалить товар");
            System.out.println("3: Найти самый дорогой товар");
            System.out.println("4: Общая стоимость товаров");
            System.out.println("6: Вывод всех товаров");
            System.out.println("7: Выход");
````

- используйте цикл while для работы с меню

  </details>

</details>
