# Инкремент и декремент в Java

## Определение

### Инкремент

Инкремент — это операция, которая увеличивает значение переменной на единицу. В Java для этого используется оператор `++`.

### Декремент

Декремент — это операция, которая уменьшает значение переменной на единицу. В Java для этого используется оператор `--`.

## Префиксная и постфиксная формы

### Префиксный инкремент (`++i`)

В этой форме сначала увеличивается значение переменной на 1, а затем оно используется в выражении.

#### Пример:

```java
public class IncidentCounterexample {

    public static void main(String[] args) {
        int counter = 123;              // 123
        counter++;                      // 123 (+1 после этой сроки, т.е. станет 124)
        System.out.println(++counter);  // 125 (т.к. ++counter, т.е. к прошлому значению (124) сначала прибавили 1)
    }

    public static void prefixIncrement() {
        int i = 5;
        int j = ++i; // i = 6, j = 6
        System.out.println(j); // 6
        System.out.println(i); // 6
    }

    public static void postfixIncrement() {
        int i = 5;
        int j = i++; // i = 5 (+1), j = 5
        System.out.println(j); // 5
        System.out.println(i); // 6
    }

    public static void prefixDecrement() {
        int i = 5;
        int j = --i; // i = 4, j = 4
        System.out.println(j); // 4
        System.out.println(i); // 4
    }

    public static void postfixDecrement() {
        int i = 5;
        int j = i--; // i = 5 (-1), j = 5
        System.out.println(j); // 5
        System.out.println(i); // 4
    }
}
```

**еще раз:**
- В случае с ++i (префиксный инкремент), значение i увеличивается на 1 до выполнения операции, и это новое значение используется в выражении.
- В случае с i++ (постфиксный инкремент), текущее значение i используется в выражении, и только после этого i увеличивается на 1.
- То же самое относится и к декременту (--i и i--).

## Циклы "while" / "do ... while"

**Циклы** позволяют выполнить некий код несколько раз подряд
Каждый такой повтор называется **итерацией**

### Цикл **while** - цикл с **_предусловием_**

Цикл **while** выполняется до тех пор, пока заданное условие является верным (имеет значение **true**):


// цикл с предусловием
while (expression) { // expression - предикат
    ...
    // Тело цикла
    ...
}
```

```java
public class WhileLoop {
    public static void main(String[] args) {
        int j = 6;
        while (j > 0) {
            System.out.println(j);
            j--;
        }
    }
}
```

**Предикат** — условие, которое указывается в скобках после ключевого слова while и вычисляется на каждой итерации

**Тело цикла** — блок кода в фигурных скобках, аналогичный блоку кода в методе. Все константы или переменные,
определенные внутри этого блока, будут видны только внутри этого блока

### цикл **do-while** - цикл с **_постусловием_**

- Цикл do сначала выполняет код цикла, а потом проверяет условие в инструкции while. И пока это условие истинно, цикл
  повторяется.

```
// цикл с постусловием
do {
    ...
    // Тело цикла
    ...
} while (expression) //expression - предикат
```

```java
public class DoLoop {
    public static void main(String[] args) {
        int j = 6;
        do {
            System.out.println(j);
            j--;
        } while (j > 0);
    }
}
```

**Важно отметить, что цикл do гарантирует хотя бы однократное выполнение действий, даже если условие в инструкции while
не
будет истинно.**

### Практика:

- Распечатать 10 строк: “Task1”. “Task2”. … “Task10”. _Используем цикл while_
- Распечатать все числа от 1 до 100, которые делятся на 5 без остатка. _Используем цикл do-while_
- Распечатать только 7 чисел от 1 до 100, которые делятся на 5 без остатка. _Используем цикл while_
- Четные числа: Напишите программу, которая выводит все четные числа от **A** до **B**. _Используем цикл do-while_
- Обратный отсчет: Напишите программу, которая начинает обратный отсчет от **A** до 0 с паузой в 1 секунду между
  числами. (Подсказка: используйте Thread.sleep(1000); для паузы). _Используем цикл while_
- Таблица умножения: Напишите программу, которая выводит таблицу умножения для числа 5 (от 1 до 10). _Используем цикл
  do-while_

````java
// Распечатать 10 строк: “Task1”. “Task2”. … “Task10”. Используем цикл while
public class Main {
    public static void main(String[] args) {
        int i = 1;
        while (i <= 10) {
            System.out.println("Task" + i);
            i++;
        }
    }
}

````

````java
// Распечатать все числа от 1 до 100, которые делятся на 5 без остатка. Используем цикл do-while
public class Main {
    public static void main(String[] args) {
        int i = 1;
        do {
            if (i % 5 == 0) {
                System.out.println(i);
            }
            i++;
        } while (i <= 100);
    }
}
````

````java
// Распечатать только 7 чисел от 1 до 100, которые делятся на 5 без остатка. Используем цикл while
public class Main {
    public static void main(String[] args) {
        int i = 1;
        int count = 0;
        while (count < 7) {
            if (i % 5 == 0) {
                System.out.println(i);
                count++;
            }
            i++;
        }
    }
}
````
 
