package task_02;

import java.util.List;

public class Main {

    public static void main(String[] args) {

        List<String> numbers = List.of("10", "20", "30", "10", "100", "50");

        // 10, 10, 100, 20, 30, 50 - алфавитная сортировка
        // 10, 10, 20, 30, 50, 100 - математическая сортировка по возрастанию

        String result = numbers.stream()
                .reduce((x, y) -> x + y)
                .orElse("");

        System.out.println("Результат - " + result);

        // Получить сумму чисел математически
        // Преобразовать строки в числа - сложить их математически -
        // результат преобразовать в стринг

        String result1 = String.valueOf(
                numbers.stream() // стрим строк "10", "20", "30", "10", "100", "50"
                .map(x -> Integer.parseInt(x)) // стрим чисел 10, 20, 30, 10, 100, 50
                .reduce((x, y) -> x + y) // 220
                .orElse(0)
        );

        System.out.println("Результат - " + result1);

        // Найти количество элементов, которые меньше 50

        long result2 = numbers.stream() // стрим строк "10", "20", "30", "10", "100", "50"
                .map(x -> Integer.parseInt(x)) // стрим чисел 10, 20, 30, 10, 100, 50
                .filter(x -> x < 50) // стрим чисел 10, 20, 30, 10
                .count(); // 4

        System.out.println("Результат - " + result2);

        // 1. Подсчитать количество элементов, содержащих подстроку "10"
        // 2. Отсортировать лист в алфавитном порядке
        // 3. Отсортировать лист в математическом порядке по возрастанию
        // 4. Найти максимальное число
    }
}